In [1]:
import numpy as np
import pandas as pd

labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [2]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [4]:

ser1 = pd.Series([1,2,3,4,5,6], ['USA', 'Italy', 'Russia', 'India', 'Thailand', 'Egypt'])
ser1

USA         1
Italy       2
Russia      3
India       4
Thailand    5
Egypt       6
dtype: int64

In [5]:
ser2 = pd.Series([1,2,3,5,6,7], ['USA', 'UAE', 'India', 'Canada', 'UK', 'Jamaica'])
ser2

USA        1
UAE        2
India      3
Canada     5
UK         6
Jamaica    7
dtype: int64

In [6]:
ser2['Jamaica']

7

In [7]:
ser3 = pd.Series(data = labels)

In [8]:
ser3

0    a
1    b
2    c
dtype: object

In [9]:
ser3[0]

'a'

In [10]:
ser1+ser2

Canada      NaN
Egypt       NaN
India       7.0
Italy       NaN
Jamaica     NaN
Russia      NaN
Thailand    NaN
UAE         NaN
UK          NaN
USA         2.0
dtype: float64

In [11]:
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df['New'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df.drop('New',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [20]:
#Permanently deleted the 'New' cell.
df.drop('New', axis = 1, inplace = True)

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

# To grab row in dataset.

In [23]:
#row
#Locational-Labelled-Based.
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [24]:
#row method 2->which takes index of a row.
#Numerical Based Index.
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [25]:
#For viewing single value.
df.loc['A','W']

2.706849839399938

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.loc[['A','B'], ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [28]:
np.random.seed(101)

In [29]:
DF1 = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [30]:
DF1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
DF1 > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [32]:
DF1['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [33]:
DF1['X'] < 0

A    False
B     True
C    False
D     True
E    False
Name: X, dtype: bool

In [34]:
DF1[DF1['X'] <0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [35]:
DF1[DF1['X'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [36]:
DF1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
DF1[DF1['W'] > 0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [38]:
res = DF1['W'] > 0
myRes = DF1[res]
myCol = ['X','Y']
myRes[myCol]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [39]:
#DF1[(DF1['W'] > 0) and (DF1['Y'] > 1)] -> This will throw valueError - Series is ambigious.
DF1[(DF1['W'] > 0) & (DF1['Z'] > 1)] # '&' is used as and operator here.

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [40]:
DF1[(DF1['W'] > 0) | (DF1['Y'] >1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
DF1.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
newind = "CA NY WY OR CO".split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
DF1['RANGE'] = newind

In [44]:
DF1

          W         X         Y         Z RANGE
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [45]:
DF1.set_index("RANGE")

              W         X         Y         Z
RANGE
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [46]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [47]:
q = pd.Series([1,2,3,4.7,5,6])
q

0    1.0
1    2.0
2    3.0
3    4.7
4    5.0
5    6.0
dtype: float64

In [48]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [49]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [50]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [51]:
d1f = pd.DataFrame(randn(6,2), hier_index,['A', 'B'])
d1f

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [52]:
d1f.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [53]:
d1f.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [54]:
d1f.index.names

FrozenList([None, None])

In [55]:
d1f.index.names = ['Groups','Key']

In [56]:
d1f

                   A         B
Groups Key
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [57]:
r = d1f.loc['G2'].loc[3]
r

A    0.638787
B    0.329646
Name: 3, dtype: float64

In [58]:
r['B']

0.32964629880452445

In [59]:
r['A']

0.638787013499328

In [60]:
d1f.xs('G1')

            A         B
Key
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [61]:
d1f.xs(1, level = "Key")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [62]:
d1f

                   A         B
Groups Key
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [63]:
DF1

          W         X         Y         Z RANGE
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

# Missing Data

In [64]:
num = {'A': [1,np.nan,3],'B':[2,np.nan,np.nan],'C':[1,2,3],'D':[4,np.nan,6]}
d = pd.DataFrame(num)
d

     A    B  C    D
0  1.0  2.0  1  4.0
1  NaN  NaN  2  NaN
2  3.0  NaN  3  6.0

In [65]:
d.dropna()

     A    B  C    D
0  1.0  2.0  1  4.0

In [66]:
d.dropna(thresh = 2)

     A    B  C    D
0  1.0  2.0  1  4.0
2  3.0  NaN  3  6.0

In [67]:
d.fillna(value = 'Biryani')

         A        B  C        D
0      1.0      2.0  1      4.0
1  Biryani  Biryani  2  Biryani
2      3.0  Biryani  3      6.0

In [68]:
d['D'].fillna(value = d['D'].mean())

0    4.0
1    5.0
2    6.0
Name: D, dtype: float64

# Groupby

In [77]:
n = {'Company' : ['GOOG','MSFT','AMZN','GOOG','FB','MSFT','FB','AMZN'],
    'Employee' : ['Sam','John','Sana','Peter','Smith','Sarah','Black','Jennie'],
    'Sales' :  [150,240,567,900,111,453,897,902]}

In [78]:
p = pd.DataFrame(n)
p

  Company Employee  Sales
0    GOOG      Sam    150
1    MSFT     John    240
2    AMZN     Sana    567
3    GOOG    Peter    900
4      FB    Smith    111
5    MSFT    Sarah    453
6      FB    Black    897
7    AMZN   Jennie    902

In [79]:
byGroup = p.groupby('Company')
byGroup

In [80]:
byGroup.mean()

         Sales
Company
AMZN     734.5
FB       504.0
GOOG     525.0
MSFT     346.5

In [81]:
byGroup.sum()

         Sales
Company
AMZN      1469
FB        1008
GOOG      1050
MSFT       693

In [82]:
byGroup.std()

              Sales
Company
AMZN     236.880772
FB       555.785930
GOOG     530.330086
MSFT     150.613744

In [86]:
byGroup.sum().loc['FB']

Sales    1008
Name: FB, dtype: int64

In [87]:
p.groupby('Company').sum().loc['FB']

Sales    1008
Name: FB, dtype: int64

In [88]:
p.groupby('Company').count()

         Employee  Sales
Company
AMZN            2      2
FB              2      2
GOOG            2      2
MSFT            2      2

In [89]:
p.groupby('Company').max()

        Employee  Sales
Company
AMZN        Sana    902
FB         Smith    897
GOOG         Sam    900
MSFT       Sarah    453

In [90]:
p.groupby('Company').min()

        Employee  Sales
Company
AMZN      Jennie    567
FB         Black    111
GOOG       Peter    150
MSFT        John    240

In [91]:
p.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
AMZN      2.0  734.5  236.880772  567.0  650.75  734.5  818.25  902.0
FB        2.0  504.0  555.785930  111.0  307.50  504.0  700.50  897.0
GOOG      2.0  525.0  530.330086  150.0  337.50  525.0  712.50  900.0
MSFT      2.0  346.5  150.613744  240.0  293.25  346.5  399.75  453.0

In [ ]:
p.groupby('Company')